{
  "backend/main.mo": "Main canister logic handling user profiles, access control, balance updates, and profile-related queries with migration support.",
  "backend/migration.mo": "Migration module converting old user profiles to the new extended format while preserving all other actor state.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries for all major frontend files and assets.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH dark theme variables and base element resets.",
  "frontend/index.html": "HTML entry point defining metadata, pt-BR language, font loading, and root mount point.",
  "frontend/src/App.tsx": "Core React app wiring authentication, profile setup, theming, routing, and global query client.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that collects and saves user profile info with role‑specific fields when no profile exists.",
  "frontend/src/components/auth/RequireAuth.tsx": "Gatekeeper that checks Internet Identity status and renders login UI or children accordingly.",
  "frontend/src/components/auth/RoleGate.tsx": "Component that blocks access for non-admins and shows an access denied alert.",
  "frontend/src/components/branding/AppMark.tsx": "Renders the app logo and name using localized strings.",
  "frontend/src/components/branding/Footer.tsx": "Displays footer with attribution, current year, and a referral link.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing main content area and a persistent bottom tab bar.",
  "frontend/src/components/navigation/BottomTabBar.tsx": "Bottom navigation bar that switches routes and highlights the active tab.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login flow, stored identity restoration, and status management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for profiles, tickets, favorites, and announcements.",
  "frontend/src/i18n/strings.pt-BR.ts": "Portuguese string dictionary containing all UI labels and messages.",
  "frontend/src/i18n/useStrings.ts": "Exports a hook and helper to access localized string values.",
  "frontend/src/index.css": "Sets Tailwind layers and defines CSS variables, base styles, and typography for light/dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/IngressosPage.tsx": "Displays user tickets, ticket statuses, and admin validation access with conditional rendering.",
  "frontend/src/pages/InicioPage.tsx": "Shows home page with quick-access cards and announcements with priority indicators.",
  "frontend/src/pages/MapaPage.tsx": "Renders event map legend, a placeholder map, and points of interest categories.",
  "frontend/src/pages/PerfilPage.tsx": "Shows user profile, balance, roles, and admin tools with logout handling.",
  "frontend/src/pages/ProgramacaoPage.tsx": "Provides event schedule tabs, favorites management, and sections for tattoo, moto, and lineup content.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, typography, animations, and plugin integrations.",
  "project_state.json": "Defines the project’s state, goals, and feature list for building a dark‑mode mobile event app with pt‑BR UI and role‑based navigation."
}